In [33]:
import pandas as pd

In [34]:
array_personas = [
    ['Moises Marin Tantalean', 23, 1.70, 89.25, 0, 'Estudiante', 'Masculino', 'Mestizo', 0, ],
    ['Maricielo Marin Tantalean', 22, 1.66, 70.35, 0, 'Profesional', 'Femenino', 'Blanco', 1025, ],
    ['Nancy Tantalean Cabrales', 53, 1.64, 80.26, 2, 'Profesional', 'Femenino', 'Mulata', 4000.25, ],
    ['Moises Marin Aguilar', 58, 1.69, 73.22, 2, 'Profesional', 'Masculino', 'Mestizo', 2000.25, ],
]

In [35]:
data = pd.DataFrame(data=array_personas, columns=['nombres', 'edad', 'altura', 'peso', 'n_hijos', 'perfil', 'genero', 'etnia', 'ingreso'])
data

,nombres,edad,altura,peso,n_hijos,perfil,genero,etnia,ingreso
0,Moises Marin Tantalean,23,1.70,89.25,0,Estudiante,Masculino,Mestizo,0.00
1,Maricielo Marin Tantalean,22,1.66,70.35,0,Profesional,Femenino,Blanco,1025.00
2,Nancy Tantalean Cabrales,53,1.64,80.26,2,Profesional,Femenino,Mulata,4000.25
3,Moises Marin Aguilar,58,1.69,73.22,2,Profesional,Masculino,Mestizo,2000.25

In [36]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [37]:
data['ingreso_anual'] = data['ingreso'] * 12
data

,nombres,edad,altura,peso,n_hijos,perfil,genero,etnia,ingreso,ingreso_anual
0,Moises Marin Tantalean,23,1.70,89.25,0,Estudiante,Masculino,Mestizo,0.00,0.0
1,Maricielo Marin Tantalean,22,1.66,70.35,0,Profesional,Femenino,Blanco,1025.00,12300.0
2,Nancy Tantalean Cabrales,53,1.64,80.26,2,Profesional,Femenino,Mulata,4000.25,48003.0
3,Moises Marin Aguilar,58,1.69,73.22,2,Profesional,Masculino,Mestizo,2000.25,24003.0

In [38]:
data['imc'] = data['peso'] / (data['altura'] * data['altura'])
data

,nombres,edad,altura,peso,n_hijos,perfil,genero,etnia,ingreso,ingreso_anual,imc
0,Moises Marin Tantalean,23,1.70,89.25,0,Estudiante,Masculino,Mestizo,0.00,0.0,30.882353
1,Maricielo Marin Tantalean,22,1.66,70.35,0,Profesional,Femenino,Blanco,1025.00,12300.0,25.529830
2,Nancy Tantalean Cabrales,53,1.64,80.26,2,Profesional,Femenino,Mulata,4000.25,48003.0,29.840869
3,Moises Marin Aguilar,58,1.69,73.22,2,Profesional,Masculino,Mestizo,2000.25,24003.0,25.636357

In [39]:
data['nombres'], data['ingreso']

(0       Moises Marin Tantalean
 1    Maricielo Marin Tantalean
 2     Nancy Tantalean Cabrales
 3         Moises Marin Aguilar
 Name: nombres, dtype: object,
 0       0.00
 1    1025.00
 2    4000.25
 3    2000.25
 Name: ingreso, dtype: float64)

In [40]:
data[['nombres', 'genero']]

                     nombres     genero
0     Moises Marin Tantalean  Masculino
1  Maricielo Marin Tantalean   Femenino
2   Nancy Tantalean Cabrales   Femenino
3       Moises Marin Aguilar  Masculino

In [41]:
data[(data['ingreso'] > 1500) & (data['genero'] == 'Femenino')]

,nombres,edad,altura,peso,n_hijos,perfil,genero,etnia,ingreso,ingreso_anual,imc
2,Nancy Tantalean Cabrales,53,1.64,80.26,2,Profesional,Femenino,Mulata,4000.25,48003.0,29.840869

In [42]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   nombres        4 non-null      object
 1   edad           4 non-null      int64
 2   altura         4 non-null      float64
 3   peso           4 non-null      float64
 4   n_hijos        4 non-null      int64
 5   perfil         4 non-null      object
 6   genero         4 non-null      object
 7   etnia          4 non-null      object
 8   ingreso        4 non-null      float64
 9   ingreso_anual  4 non-null      float64
 10  imc            4 non-null      float64
dtypes: float64(5), int64(2), object(4)
memory usage: 480.0+ bytes

In [43]:
data.isnull().sum()

nombres          0
edad             0
altura           0
peso             0
n_hijos          0
perfil           0
genero           0
etnia            0
ingreso          0
ingreso_anual    0
imc              0
dtype: int64

In [44]:
data.columns

Index(['nombres', 'edad', 'altura', 'peso', 'n_hijos', 'perfil', 'genero',
       'etnia', 'ingreso', 'ingreso_anual', 'imc'],
      dtype='object')

In [45]:
data[1:]

,nombres,edad,altura,peso,n_hijos,perfil,genero,etnia,ingreso,ingreso_anual,imc
1,Maricielo Marin Tantalean,22,1.66,70.35,0,Profesional,Femenino,Blanco,1025.00,12300.0,25.529830
2,Nancy Tantalean Cabrales,53,1.64,80.26,2,Profesional,Femenino,Mulata,4000.25,48003.0,29.840869
3,Moises Marin Aguilar,58,1.69,73.22,2,Profesional,Masculino,Mestizo,2000.25,24003.0,25.636357

In [46]:
data.iloc[3,1]

np.int64(58)

In [47]:
data.loc[0:2, ['nombres', 'edad']]

                     nombres  edad
0     Moises Marin Tantalean    23
1  Maricielo Marin Tantalean    22
2   Nancy Tantalean Cabrales    53

In [48]:
data.iloc[0:3, [2, 3]]

   altura   peso
0    1.70  89.25
1    1.66  70.35
2    1.64  80.26